import time

import PDDTVisionToolBox as pd
import numpy as np

# 设定ur机械臂IP地址及端口号
IPRob = "192.168.0.101"
PortNumberRob = 30003
# 初始位置
PosOri = np.array([[3.15151768e-01, 1.09421803e-01, 9.14757143e-01, 2.90234867e+00, 1.20230813e+00, 1.08722478e-04]])
# 路径位姿
PosRoutine = np.array([[3.15151768e-01, 1.09421803e-01, 0.814757143, 2.90234867e+00, 1.20230813e+00, 1.08722478e-04],
                       [0.67539009, 0.10940512, 0.73234535, -2.44773435, -1.01151366, 1.05469529],
                       [0.57827971, -0.13085772, 0.73534526, -2.22897396, -0.34734475, 0.6244097],
                       [0.30410951, -0.1682767, 0.73532654, -2.36292187, -0.97716735, -0.30470076],
                       [3.15151768e-01, 1.09421803e-01, 0.814757143, 2.90234867e+00, 1.20230813e+00, 1.08722478e-04],
                       ])
time.sleep(10)
for i in range(4):
    pd.getUR10EMove(IPRob, PortNumberRob, PosRoutine[i, 0], PosRoutine[i, 1], PosRoutine[i, 2], PosRoutine[i, 3],
                    PosRoutine[i, 4], PosRoutine[i, 5])
